In [3]:
import numpy as np
import pandas as pd

In [6]:
s = pd.Series(np.random.random(4), index=list('aabc'))
s

a    0.546020
a    0.569606
b    0.726126
c    0.025114
dtype: float64

In [83]:
data = {i: np.random.randint(10) for i in [1,'a',2,'b']}
s = pd.Series(data)
s
print(type(data))

<class 'dict'>

In [11]:
s = pd.Series(data, index=list('facdxyz'))
s

f    NaN
a    2.0
c    NaN
d    NaN
x    NaN
y    NaN
z    NaN
dtype: float64

In [14]:
s = pd.Series(666, index=list('abcdef'))
s

a    666
b    666
c    666
d    666
e    666
f    666
dtype: int64

In [18]:
s[[1,2,3]]+1

b    667
c    667
d    667
dtype: int64

In [17]:
s.mean()

666.0

In [20]:
s['d']

666

In [22]:
s1 = pd.Series(np.random.random(4),
               index=list('abcd'))
s2 = pd.Series(np.random.random(4),
               index=list('acex'))
s1+s2

a    0.852891
b         NaN
c    0.694868
d         NaN
e         NaN
x         NaN
dtype: float64

In [23]:
s = pd.Series(666, index=list('abcdef'))
s.rename("devil")

a    666
b    666
c    666
d    666
e    666
f    666
Name: devil, dtype: int64

In [35]:
data = {'first_column': pd.Series(np.random.random(6), index=list('abcefg')),
        'devil': pd.Series(666, index=list('abcefg')),
        'third_column': pd.Series(np.random.random(6), index=list('abcefg'))}
df = pd.DataFrame(data)
df

   first_column  devil  third_column
a      0.629433    666      0.358942
b      0.038037    666      0.096418
c      0.992008    666      0.845761
e      0.465748    666      0.653061
f      0.784235    666      0.701828
g      0.821134    666      0.363410

In [36]:
pd.DataFrame(data, index=['a','g'])

   first_column  devil  third_column
a      0.629433    666      0.358942
g      0.821134    666      0.363410

In [37]:
pd.DataFrame(data,
             # указываем нужные индексы:
             index=['c', 'f'],
             # указываем необходимые столбцы:
             columns=[
                      'devil'
                      ])

   devil
c    666
f    666

In [38]:
#???
data = np.array([('a', 11, .9),
                 ('b', 22, .8),
                 ('c', 33, 0.7)],
                dtype=[('col_1', 'U1'),
                       ('col_2', 'i2'),
                       ('col_3', 'f2')])
pd.DataFrame(data)

  col_1  col_2     col_3
0     a     11  0.899902
1     b     22  0.799805
2     c     33  0.700195

In [42]:
data = np.array([('a', 11, .9),
                 ('b', 22, .8),
                 ('c', 33, 0.7)])
pd.DataFrame(data, index=['one', 'two', 'three'],columns=['col_1', 'col_2', 'col_3'])

      col_1 col_2 col_3
one       a    11   0.9
two       b    22   0.8
three     c    33   0.7

In [8]:
data = [{'a': 22, 'b': 11},
        {'b': 33, 'c': 44},
        {'a': 55, 'c': 66}]

df = pd.DataFrame(data,
             index=['one', 'two', 'three'],
             columns=['c', 'a', 'b'])

In [10]:
df['d'] = df['c'] * 2
print(df)

          c     a     b      d
one     NaN  22.0  11.0    NaN
two    44.0   NaN  33.0   88.0
three  66.0  55.0   NaN  132.0

In [11]:
df.pop('d')

one        NaN
two       88.0
three    132.0
Name: d, dtype: float64

In [12]:
df.insert(1, 'd', df['c'] * 2)

In [13]:
df

          c      d     a     b
one     NaN    NaN  22.0  11.0
two    44.0   88.0   NaN  33.0
three  66.0  132.0  55.0   NaN

In [14]:
#выравнивание
df['g'] = df['c'][::2]

In [15]:
df

          c      d     a     b     g
one     NaN    NaN  22.0  11.0   NaN
two    44.0   88.0   NaN  33.0   NaN
three  66.0  132.0  55.0   NaN  66.0

In [18]:
df.assign(f=lambda x: x['a']*x['b'])

          c      d     a     b     g      f
one     NaN    NaN  22.0  11.0   NaN  242.0
two    44.0   88.0   NaN  33.0   NaN    NaN
three  66.0  132.0  55.0   NaN  66.0    NaN

In [20]:
#Строки
df.loc['one']

c     NaN
d     NaN
a    22.0
b    11.0
g     NaN
Name: one, dtype: float64

In [25]:
df.iloc[0:3]

          c      d     a     b     g
one     NaN    NaN  22.0  11.0   NaN
two    44.0   88.0   NaN  33.0   NaN
three  66.0  132.0  55.0   NaN  66.0

In [26]:
df

          c      d     a     b     g
one     NaN    NaN  22.0  11.0   NaN
two    44.0   88.0   NaN  33.0   NaN
three  66.0  132.0  55.0   NaN  66.0

In [38]:
df_1 = pd.DataFrame(np.arange(2*3).reshape(2, 3),
                    index=['row_'+str(i) for i in range(2)],
                    columns=['col_'+str(i) for i in range(3)])
df_2 = pd.DataFrame(np.arange(3*5). reshape(3, 5),
                    index=['row_'+str(i) for i in range(3)],
                    columns=['col_'+str(i) for i in range(5)])

In [39]:
df_1

       col_0  col_1  col_2
row_0      0      1      2
row_1      3      4      5

In [51]:
df_2

       col_0  col_1  col_2  col_3  col_4
row_0      0      1      2      3      4
row_1      5      6      7      8      9
row_2     10     11     12     13     14

In [41]:
df_1 * df_2

       col_0  col_1  col_2  col_3  col_4
row_0    0.0    1.0    4.0    NaN    NaN
row_1   15.0   24.0   35.0    NaN    NaN
row_2    NaN    NaN    NaN    NaN    NaN

In [59]:
s = df_2.iloc[0]

In [60]:
s

col_0    0
col_1    1
col_2    2
col_3    3
col_4    4
Name: row_0, dtype: int32

In [61]:
df_2 * s

       col_0  col_1  col_2  col_3  col_4
row_0      0      1      4      9     16
row_1      0      6     14     24     36
row_2      0     11     24     39     56

In [54]:
s = df_2['col_1']

In [55]:
s

row_0     1
row_1     6
row_2    11
Name: col_1, dtype: int32

In [56]:
df_2.sub(s,axis=0)

       col_0  col_1  col_2  col_3  col_4
row_0     -1      0      1      2      3
row_1     -1      0      1      2      3
row_2     -1      0      1      2      3

In [62]:
2**df_2

       col_0  col_1  col_2  col_3  col_4
row_0      1      2      4      8     16
row_1     32     64    128    256    512
row_2   1024   2048   4096   8192  16384

In [63]:
df_2.T

       row_0  row_1  row_2
col_0      0      5     10
col_1      1      6     11
col_2      2      7     12
col_3      3      8     13
col_4      4      9     14

In [64]:
np.mean(df_2)

D:\Apps\miniconda\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

col_0    5.0
col_1    6.0
col_2    7.0
col_3    8.0
col_4    9.0
dtype: float64

In [65]:
import seaborn as sns

In [67]:
data = sns.load_dataset('iris')

In [68]:
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [69]:
data.info

<bound method DataFrame.info of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [70]:
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [71]:
data.shape

(150, 5)

In [72]:
data.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [73]:
data.index

RangeIndex(start=0, stop=150, step=1)

In [74]:
type(data)

pandas.core.frame.DataFrame

In [75]:
data.to_numpy

<bound method DataFrame.to_numpy of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [78]:
data['species'].to_numpy()

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype=object)

In [79]:
s_dt = pd.Series(pd.date_range('01/01/2020',
                               periods=5,
                               tz="Europe/Moscow"))

In [80]:
s_dt.to_numpy(dtype="datetime64[ns]")

array(['2019-12-31T21:00:00.000000000', '2020-01-01T21:00:00.000000000',
       '2020-01-02T21:00:00.000000000', '2020-01-03T21:00:00.000000000',
       '2020-01-04T21:00:00.000000000'], dtype='datetime64[ns]')

In [81]:
data.to_numpy()

array([[5.1, 3.5, 1.4, 0.2, 'setosa'],
       [4.9, 3.0, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.6, 1.4, 0.2, 'setosa'],
       [5.4, 3.9, 1.7, 0.4, 'setosa'],
       [4.6, 3.4, 1.4, 0.3, 'setosa'],
       [5.0, 3.4, 1.5, 0.2, 'setosa'],
       [4.4, 2.9, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.4, 3.7, 1.5, 0.2, 'setosa'],
       [4.8, 3.4, 1.6, 0.2, 'setosa'],
       [4.8, 3.0, 1.4, 0.1, 'setosa'],
       [4.3, 3.0, 1.1, 0.1, 'setosa'],
       [5.8, 4.0, 1.2, 0.2, 'setosa'],
       [5.7, 4.4, 1.5, 0.4, 'setosa'],
       [5.4, 3.9, 1.3, 0.4, 'setosa'],
       [5.1, 3.5, 1.4, 0.3, 'setosa'],
       [5.7, 3.8, 1.7, 0.3, 'setosa'],
       [5.1, 3.8, 1.5, 0.3, 'setosa'],
       [5.4, 3.4, 1.7, 0.2, 'setosa'],
       [5.1, 3.7, 1.5, 0.4, 'setosa'],
       [4.6, 3.6, 1.0, 0.2, 'setosa'],
       [5.1, 3.3, 1.7, 0.5, 'setosa'],
       [4.8, 3.4, 1.9, 0.2, 'setosa'],
       [5.0, 3.0, 1.6, 0.2, 'setosa'],
       [5.0, 3.4, 1.6, 0.4, 'setosa'],
       [5.2, 3.5, 1.5, 0.2, 'setosa'],
       [5.2, 3.4, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.6, 0.2, 'setosa'],
       [4.8, 3.1, 1.6, 0.2, 'setosa'],
       [5.4, 3.4, 1.5, 0.4, 'setosa'],
       [5.2, 4.1, 1.5, 0.1, 'setosa'],
       [5.5, 4.2, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.2, 1.2, 0.2, 'setosa'],
       [5.5, 3.5, 1.3, 0.2, 'setosa'],
       [4.9, 3.6, 1.4, 0.1, 'setosa'],
       [4.4, 3.0, 1.3, 0.2, 'setosa'],
       [5.1, 3.4, 1.5, 0.2, 'setosa'],
       [5.0, 3.5, 1.3, 0.3, 'setosa'],
       [4.5, 2.3, 1.3, 0.3, 'setosa'],
       [4.4, 3.2, 1.3, 0.2, 'setosa'],
       [5.0, 3.5, 1.6, 0.6, 'setosa'],
       [5.1, 3.8, 1.9, 0.4, 'setosa'],
       [4.8, 3.0, 1.4, 0.3, 'setosa'],
       [5.1, 3.8, 1.6, 0.2, 'setosa'],
       [4.6, 3.2, 1.4, 0.2, 'setosa'],
       [5.3, 3.7, 1.5, 0.2, 'setosa'],
       [5.0, 3.3, 1.4, 0.2, 'setosa'],
       [7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [6.3, 3.3, 6.0, 2.5, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [7.1, 3.0, 5.9, 2.1, 'virginica'],
       [6.3, 2.9, 5.6, 1.8, 'virginica'],
       [6.5, 3.0, 5.8, 2.2, 'virginica'],
       [7.6, 3.0, 6.6, 2.1, 'virginica'],
       [4.9, 2.5, 4.5, 1.7, 'virginica'],
       [7.3, 2.9, 6.3, 1.8, 'virginica'],
       [6.7, 2.5, 5.8, 1.8, 'virginica'],
       [7.2, 3.6, 6.1, 2.5, 'virginica'],
       [6.5, 3.2, 5.1, 2.0, 'virginica'],
       [6.4, 2.7, 5.3, 1.9, 'virginica'],
       [6.8, 3.0, 5.5, 2.1, 'virginica'],
       [5.7, 2.5, 5.0, 2.0, 'virginica'],
       [5.8, 2.8, 5.1, 2.4, 'virginica'],
       [6.4, 3.2, 5.3, 2.3, 'virginica'],
       [6.5, 3.0, 5.5, 1.8, 'virginica'],
       [7.7, 3.8, 6.7, 2.2, 'virginica'],
       [7.7, 2.6, 6.9, 2.3, 'virginica'],
       [6.0, 2.2, 5.0, 1.5, 'virginica'],
       [6.9, 3.2, 5.7, 2.3, 'virginica'],
       [5.6, 2.8, 4.9, 2.0, 'virginica'],
       [7.7, 2.8, 6.7, 2.0, 'virginica'],
       [6.3, 2.7, 4.9, 1.8, 'virginica'],
       [6.7, 3.3, 5.7, 2.1, 'virginica'],
       [7.2, 3.2, 6.0, 1.8, 'virginica'],
       [6.2, 2.8, 4.8, 1.8, 'virginica'],
       [6.1, 3.0, 4.9, 1.8, 'virginica'],
       [6.4, 2.8, 5.6, 2.1, 'virginica'],
       [7.2, 3.0, 5.8, 1.6, 'virginica'],
       [7.4, 2.8, 6.1, 1.9, 'virginica'],
       [7.9, 3.8, 6.4, 2.0, 'virginica'],
       [6.4, 2.8, 5.6, 2.2, 'virginica'],
       [6.3, 2.8, 5.1, 1.5, 'virginica'],
       [6.1, 2.6, 5.6, 1.4, 'virginica'],
       [7.7, 3.0, 6.1, 2.3, 'virginica'],
       [6.3, 3.4, 5.6, 2.4, 'virginica'],
       [6.4, 3.1, 5.5, 1.8, 'virginica'],
       [6.0, 3.0, 4.8, 1.8, 'virginica'],
       [6.9, 3.1, 5.4, 2.1, 'virginica'],
       [6.7, 3.1, 5.6, 2.4, 'virginica'],
       [6.9, 3.1, 5.1, 2.3, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [6.8, 3.2, 5.9, 2.3, 'virginica'],
       [6.7, 3.3, 5.7, 2.5, 'virginica'],
       [6.7, 3.0, 5.2, 2.3, 'virginica'],
       [6.3, 2.5, 5.0, 1.9, 'virginica'],
       [6.5, 3.0, 5.2, 2.0, 'virginica'],
       [6.2, 3.4, 5.4, 2.3, 'virginica'],
       [5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)